In [1]:
import numpy as np
import pandas as pd
import sklearn
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier

In [2]:
df1=pd.read_csv("test.csv")

In [3]:
df2=pd.read_csv("train.csv")

In [4]:
df3=df2

In [5]:
Id=df1['Id']

In [6]:
X_train=df3

In [7]:
X_train=X_train.drop(columns=['Victory Status','Id'])

In [8]:
X_train.head()

   Number of soldiers  Number of tanks  Number of aircrafts
0             2100000             4480                   70
1             2100000             4550                    0
2             2170000             4130                  140
3             2170000             4550                  280
4             2310000             4060                  700

In [9]:
df1.columns

Index(['Number of soldiers', 'Number of tanks', 'Number of aircrafts', 'Id'], dtype='object')

In [10]:
X_test=df1[['Number of soldiers', 'Number of tanks', 'Number of aircrafts']]

In [11]:
X_test.head()

   Number of soldiers  Number of tanks  Number of aircrafts
0             2100000             4340                  210
1             2380000             4130                    0
2             2380000             4620                  630
3             2380000             4060                 2100
4             2380000             4270                  700

In [12]:
X_train.head()

   Number of soldiers  Number of tanks  Number of aircrafts
0             2100000             4480                   70
1             2100000             4550                    0
2             2170000             4130                  140
3             2170000             4550                  280
4             2310000             4060                  700

In [13]:
y_train=df3['Victory Status']

In [14]:
y_train=y_train-1

In [15]:
y_train

0      0
1      0
2      0
3      0
4      0
      ..
215    0
216    1
217    0
218    0
219    1
Name: Victory Status, Length: 220, dtype: int64

In [16]:
rf=RandomForestClassifier(n_estimators=10)
rf.fit(X_train,y_train)
pred=rf.predict(X_test)
pred+=1


df=pd.DataFrame([Id,pred])

df=df.T

df.columns=(['Id','Category'])

df.index=df['Id']

df=df.drop(columns=['Id'])

In [17]:
df.to_csv('submit.csv')

In [18]:
df

     Category
Id
1           1
7           1
8           1
9           1
11          1
..        ...
293         1
296         1
301         2
303         2
305         1

[86 rows x 1 columns]